In [1]:
import pandas as pd

In [58]:
users = pd.read_csv('users.csv')
users.head()

   id                 name                                                url
0   0            Thanh Max         https://www.facebook.com/tuongvi.le.395669
1   1             Ngọc Mai  https://www.facebook.com/profile.php?id=100028...
2   2            Hà Ngoc Ý               https://www.facebook.com/ngocy.ha.79
3   3  Nguyễn Nguyên Hoàng           https://www.facebook.com/hoangmobile2711
4   4            Hoàng Đức  https://www.facebook.com/profile.php?id=100025...

In [56]:
df = pd.read_csv('all_pair.csv')
df.head()

,name1,url1,name2,url2
0,Huỳnh Tấn Phát,https://www.facebook.com/HTPViGa,Duy Nam,https://www.facebook.com/duynam.dang.754
1,Huỳnh Tấn Phát,https://www.facebook.com/HTPViGa,Lam Hong Nhung,https://www.facebook.com/LamT.HongNhung
2,Huỳnh Tấn Phát,https://www.facebook.com/HTPViGa,Cẩm Tiên Nguyễn,https://www.facebook.com/profile.php?id=100007...
3,Huỳnh Tấn Phát,https://www.facebook.com/HTPViGa,Thái Nguyên,https://www.facebook.com/profile.php?id=100014...
4,Huỳnh Tấn Phát,https://www.facebook.com/HTPViGa,Do Ngoc Han,https://www.facebook.com/hando1303

In [59]:
df = df[['url1', 'url2']]
df.head()

,url1,url2
0,https://www.facebook.com/HTPViGa,https://www.facebook.com/duynam.dang.754
1,https://www.facebook.com/HTPViGa,https://www.facebook.com/LamT.HongNhung
2,https://www.facebook.com/HTPViGa,https://www.facebook.com/profile.php?id=100007...
3,https://www.facebook.com/HTPViGa,https://www.facebook.com/profile.php?id=100014...
4,https://www.facebook.com/HTPViGa,https://www.facebook.com/hando1303

In [60]:
list_id = users['id'].to_list()
list_url = users['url'].to_list()

In [62]:
df.replace(list_url, list_id, inplace=True)

In [63]:
df.head()

   url1   url2
0  8674   2382
1  8674  12512
2  8674  10317
3  8674   1098
4  8674  14219

In [64]:
df.to_csv('relationship.csv', index = False)

In [1]:
import pandas as pd

In [2]:
relationship = pd.read_csv('data/reprocessed_data/relationship.csv')
relationship.head()

    id1    id2
0  8674   2382
1  8674  12512
2  8674  10317
3  8674   1098
4  8674  14219

In [7]:
one = pd.read_csv('../one_friend.csv')
one.head()

   id
0   0
1   1
2   3
3   4
4   5

In [8]:
one_friend_list = list(one['id'])
len(one_friend_list)

18233

In [13]:
ls = []
for i, r in relationship.iterrows():
    if r['id1'] not in one_friend_list and r['id2'] not in one_friend_list:
        ls.append(r)

In [14]:
len(ls)

24014

In [15]:
df = pd.DataFrame(ls)

In [16]:
df.head()

    id1    id2
0  8674   2382
1  8674  12512
2  8674  10317
3  8674   1098
4  8674  14219

In [19]:
len(set(df['id1']).union(set(df['id2'])))

2680

In [20]:
df.to_csv('data/reprocessed_data/reduce_relationship.csv', index=False)